Amiya200/stm32_water_tank/Core/Src/screen.c
    snprintf(l1, sizeof(l1), "Water:%s", level);

    lcd_line0(l0);
    lcd_line1(l1);
}

/* ================================================================
   UPDATED MENU RENDERER (NO FLICKER)
   ================================================================ */

static void show_menu(void)
{
    char l0[17], l1[17];

    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > (menu_view_top + 1))
        menu_view_top = menu_idx - 1;

    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);

    lcd_line0(l0);
    lcd_line1(l1);

    draw_menu_cursor();  // draw cursor separately (smooth blink)
}

/***************************************************************
 *  SCREEN.C — PART 2 / 4 (UPDATED)
 *  TIMER / AUTO / TWIST / COUNTDOWN UI
 *  APPLY FUNCTIONS
 *  Supports 5 TIMER SLOTS (Option A Layout)
 ***************************************************************/

/* ================================================================
   LCD VALUE FORMATTER
   ================================================================ */
static inline void lcd_val_next(uint16_t v){
    char buf[17];
    snprintf(buf, sizeof(buf), "val:%03u   Next>", v);
    lcd_line1(buf);
}

/* ================================================================
   INIT
   ================================================================ */
void Screen_Init(void)
{
    lcd_init();                   // Initialize I2C LCD
    lcd_clear();

    ui = UI_WELCOME;              // Start at welcome screen
    last_ui = UI_MAX_;            // Force full refresh on first update
    screenNeedsRefresh = true;

    cursorVisible = true;
    lastCursorToggle = HAL_GetTick();
    lastLcdUpdateTime = HAL_GetTick();
    refreshInactivityTimer();

    /* Reset all button press trackers */
    for (int i = 0; i < 4; i++)
    {
        sw_press_start[i] = 0;
        sw_long_issued[i] = false;
    }

    /* Default menu state */
    menu_idx = 0;
    menu_view_top = 0;

    /* Initial welcome screen */
    lcd_put_cur(0, 0);
    lcd_send_string("   HELONIX");

    lcd_put_cur(1, 0);
    lcd_send_string(" IntelligentSys");
}

/* ================================================================
   MANUAL MODE UI
   ================================================================ */
static void show_manual(void){
    lcd_line0("Manual Mode");
    lcd_line1(Motor_GetStatus() ? "val:STOP   Next>"
                                : "val:START  Next>");
}

/* ================================================================
   TIMER MODE — OPTION A (5 Slots)
   ================================================================ */

static int timer_page = 0;  // 0,1,2 depending on scroll

static void show_timer_slot_select(void)
{
    lcd_clear();

    char l0[17] = {0};
    char l1[17] = {0};

    if (timer_page == 0)      // S1, S2, S3, S4
    {
        snprintf(l0, sizeof(l0),
                 "%cS1   %cS2",
                 (currentSlot == 0 ? '>' : ' '),
                 (currentSlot == 1 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cS3   %cS4",
                 (currentSlot == 2 ? '>' : ' '),
                 (currentSlot == 3 ? '>' : ' '));
    }
    else if (timer_page == 1) // S3, S4, S5, Back
    {
        snprintf(l0, sizeof(l0),
                 "%cS3   %cS4",
                 (currentSlot == 2 ? '>' : ' '),
                 (currentSlot == 3 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cS5   %cBack",
                 (currentSlot == 4 ? '>' :
                  currentSlot == 5 ? '>' : ' '),
                 (currentSlot == 5 ? '>' : ' '));
    }
    else                      // timer_page == 2 → S5 + Back
    {
        snprintf(l0, sizeof(l0),
                 "%cS5",
                 (currentSlot == 4 ? '>' : ' '));

        snprintf(l1, sizeof(l1),
                 "%cBack",
                 (currentSlot == 5 ? '>' : ' '));
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_timer(void){
    TimerSlot *t = &timerSlots[currentSlot];

    char l0[17];
    snprintf(l0,sizeof(l0),
             "Slot %d %02d:%02d-%02d:%02d",
             currentSlot+1,
             t->onHour, t->onMinute,
             t->offHour, t->offMinute);

    lcd_line0(l0);
    lcd_line1("val:Edit   Next>");
}

static void show_timer_on_h(void){
    lcd_line0("TIMER ON HOUR");
    lcd_val_next(edit_timer_on_h);
}

static void show_timer_on_m(void){
    lcd_line0("TIMER ON MIN");
    lcd_val_next(edit_timer_on_m);
}

static void show_timer_off_h(void){
    lcd_line0("TIMER OFF HOUR");
    lcd_val_next(edit_timer_off_h);
}

static void show_timer_off_m(void){
    lcd_line0("TIMER OFF MIN");
    lcd_val_next(edit_timer_off_m);
}

/* Timer days selection (per-slot, Mon..Sun) */
static void show_timer_days(void){
    char pattern[8];
    const char names[7] = {'M','T','W','T','F','S','S'};
    for (int i = 0; i < 7; i++){
        pattern[i] = (edit_timer_dayMask & (1u << i)) ? names[i] : '-';
    }
    pattern[7] = '\0';

    char l0[17];
    snprintf(l0, sizeof(l0), "Days:%-7s", pattern);
    lcd_line0(l0);
    lcd_line1("U:Next D:Toggle");
}

/* Per-slot enable / disable */
static void show_timer_enable(void){
    lcd_line0("SLOT ENABLED?");
    lcd_line1(edit_timer_enabled ? "val:YES   Next>" : "val:NO    Next>");
}

/* ================================================================
   AUTO MODE SETTINGS
   ================================================================ */

static void show_auto_menu(void){
    lcd_line0("Auto Settings");
    lcd_line1(">Gap/Max/Retry");
}

static void show_auto_gap(void){
    lcd_line0("DRY GAP (s)");
    lcd_val_next(edit_auto_gap_s);
}

static void show_auto_maxrun(void){
    lcd_line0("MAX RUN (min)");
    lcd_val_next(edit_auto_maxrun_min);
}

static void show_auto_retry(void){
    lcd_line0("RETRY COUNT");
    lcd_val_next(edit_auto_retry);
}

/* ================================================================
   SEMI-AUTO UI
   ================================================================ */

static void show_semi_auto(void){
    lcd_line0("Semi-Auto");
    lcd_line1(semiAutoActive ? "val:Disable Next>"
                             : "val:Enable  Next>");
}

/* ================================================================
   TWIST MODE UI
   ================================================================ */

static void show_twist(void){
    char l0[17];
    snprintf(l0,sizeof(l0),
             "Tw %02ds/%02ds",
             twistSettings.onDurationSeconds,
             twistSettings.offDurationSeconds);

