Amiya200/stm32_water_tank/Core/Src/screen.c
    lcd_line0(l0);
    lcd_line1(twistActive ?  "val:STOP   Next>"
                          : "val:START  Next>");
}

static void show_twist_on_sec(void){
    lcd_line0("TWIST ON SEC");
    lcd_val_next(edit_twist_on_s);
}

static void show_twist_off_sec(void){
    lcd_line0("TWIST OFF SEC");
    lcd_val_next(edit_twist_off_s);
}

static void show_twist_on_h(void){
    lcd_line0("TWIST ON HH");
    lcd_val_next(edit_twist_on_hh);
}

static void show_twist_on_m(void){
    lcd_line0("TWIST ON MM");
    lcd_val_next(edit_twist_on_mm);
}

static void show_twist_off_h(void){
    lcd_line0("TWIST OFF HH");
    lcd_val_next(edit_twist_off_hh);
}

static void show_twist_off_m(void){
    lcd_line0("TWIST OFF MM");
    lcd_val_next(edit_twist_off_mm);
}

/* ================================================================
   COUNTDOWN UI
   ================================================================ */

static void show_countdown(void){
    char l0[17], l1[17];

    if (countdownActive){
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;

        snprintf(l0,sizeof(l0),"CD %02u:%02u RUN",min,s);
        snprintf(l1,sizeof(l1),"Press to STOP");
    } else {
        snprintf(l0,sizeof(l0),"CD Set:%3u min",edit_countdown_min);
        snprintf(l1,sizeof(l1),"Press to START");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_countdown_edit_min(void){
    lcd_line0("SET MINUTES");
    lcd_val_next(edit_countdown_min);
}

/* ================================================================
   APPLY FUNCTIONS (MENU-SAFE)
   ================================================================ */

static void apply_timer_settings(void){
    TimerSlot *t = &timerSlots[currentSlot];

    /* Copy edited time window */
    t->onHour    = edit_timer_on_h;
    t->onMinute  = edit_timer_on_m;
    t->offHour   = edit_timer_off_h;
    t->offMinute = edit_timer_off_m;

    /* Copy days + enabled flag */
    t->dayMask   = edit_timer_dayMask;
    t->enabled   = edit_timer_enabled;

    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}

static void apply_auto_settings(void){
    ModelHandle_SetAutoSettings(
        edit_auto_gap_s,
        edit_auto_maxrun_min,
        edit_auto_retry
    );
}

static void apply_twist_settings(void){
    twistSettings.onDurationSeconds  = edit_twist_on_s;
    twistSettings.offDurationSeconds = edit_twist_off_s;

    twistSettings.onHour   = edit_twist_on_hh;
    twistSettings.onMinute = edit_twist_on_mm;

    twistSettings.offHour  = edit_twist_off_hh;
    twistSettings.offMinute= edit_twist_off_mm;
}

static void apply_countdown_settings(void){
    if (edit_countdown_min == 0)
        edit_countdown_min = 1;

    countdownDuration = (uint32_t)edit_countdown_min * 60u;
}

/***************************************************************
 *  SCREEN.C — PART 3 / 4 (UPDATED FINAL VERSION)
 *  BUTTON DECODER + MENU LOCK + TIMER SLOT ENGINE (OPTION-A)
 ***************************************************************/

/* ================================================================
   BUTTON DECODER — Short / Long press logic
   ================================================================ */

static UiButton decode_button_press(void){
    bool sw1 = Switch_IsPressed(0);
    bool sw2 = Switch_IsPressed(1);
    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    bool sw[4] = {sw1, sw2, sw3, sw4};

    uint32_t now = HAL_GetTick();
    UiButton out = BTN_NONE;

    for (int i = 0; i < 4; i++)
    {
        if (sw[i] && sw_press_start[i] == 0) {
            sw_press_start[i] = now;
            sw_long_issued[i] = false;
        }
        else if (!sw[i] && sw_press_start[i] != 0){
            if (!sw_long_issued[i]){
                switch(i){
                    case 0: out = BTN_RESET; break;
                    case 1: out = BTN_SELECT; break;
                    case 2: out = BTN_UP; break;
                    case 3: out = BTN_DOWN; break;
                }
            }
            sw_press_start[i] = 0;
            sw_long_issued[i] = false;
        }
        else if (sw[i] && !sw_long_issued[i]){
            if (now - sw_press_start[i] >= LONG_PRESS_MS){
                sw_long_issued[i] = true;
                switch(i){
                    case 0: out = BTN_RESET_LONG; break;
                    case 1: out = BTN_SELECT_LONG; break;
                    case 2: out = BTN_UP_LONG; break;
                    case 3: out = BTN_DOWN_LONG; break;
                }
            }
        }
    }
    return out;
}

/* ================================================================
   MENU SELECT — Updated for 5 Timer Slots (Option-A Layout)
   ================================================================ */

static void goto_menu_top(void){
    menu_idx = 0;
    menu_view_top = 0;
}

/*
    TIMER SLOT INDEX MAPPING (Option-A)

    currentSlot = 0 → S1
    currentSlot = 1 → S2
    currentSlot = 2 → S3
    currentSlot = 3 → S4
    currentSlot = 4 → S5
    currentSlot = 5 → BACK
*/

static void menu_select(void){
    refreshInactivityTimer();

    /* WELCOME → DASH */
    if (ui == UI_WELCOME){
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* DASH → MENU */
    if (ui == UI_DASH){
        ui = UI_MENU;
        goto_menu_top();
        screenNeedsRefresh = true;
        return;
    }

    /* MAIN MENU */
    if (ui == UI_MENU){
        switch(menu_idx)
        {
            case 0: // TIMER MODE
                ui = UI_TIMER_SLOT_SELECT;
                timer_page = 0;
                currentSlot = 0;
                break;

            case 1: // AUTO MODE
                ui = UI_AUTO_MENU;
                break;

            case 2: // TWIST MODE
                ui = UI_TWIST;
                break;

            case 3: // SETTINGS (Your future extension)
                ui = UI_DASH;
                break;

            case 4: // BACK
                ui = UI_DASH;
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    /* =========== TIMER MODE =========== */

    if (ui == UI_TIMER_SLOT_SELECT)
    {
        /* BACK selected? */
        if (currentSlot == 5){
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;
        }

