Amiya200/stm32_water_tank/Core/Src/screen.c
        /* Load slot into edit buffer */
        edit_timer_on_h   = timerSlots[currentSlot].onHour;
        edit_timer_on_m   = timerSlots[currentSlot].onMinute;
        edit_timer_off_h  = timerSlots[currentSlot].offHour;
        edit_timer_off_m  = timerSlots[currentSlot].offMinute;
        edit_timer_dayMask= timerSlots[currentSlot].dayMask;
        edit_timer_enabled= timerSlots[currentSlot].enabled;
        edit_timer_dayIndex = 0;   /* start from Monday */

        ui = UI_TIMER_EDIT_SLOT_ON_H;
        screenNeedsRefresh = true;
        return;
    }

    /* TIMER EDIT SEQUENCE */
    if (ui == UI_TIMER_EDIT_SLOT_ON_H){
        ui = UI_TIMER_EDIT_SLOT_ON_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TIMER_EDIT_SLOT_ON_M){
        ui = UI_TIMER_EDIT_SLOT_OFF_H;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TIMER_EDIT_SLOT_OFF_H){
        ui = UI_TIMER_EDIT_SLOT_OFF_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TIMER_EDIT_SLOT_OFF_M){
        /* After OFF minute → go to day selection */
        ui = UI_TIMER_EDIT_SLOT_DAYS;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TIMER_EDIT_SLOT_DAYS){
        /* After days → go to enable/disable */
        ui = UI_TIMER_EDIT_SLOT_ENABLE;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TIMER_EDIT_SLOT_ENABLE){
        /* Final step → apply everything */
        apply_timer_settings();
        ui = UI_TIMER_SLOT_SELECT;
        screenNeedsRefresh = true;
        return;
    }

    /* AUTO MODE SEQUENCE */
    if (ui == UI_AUTO_MENU){
        ui = UI_AUTO_EDIT_GAP;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_AUTO_EDIT_GAP){
        ui = UI_AUTO_EDIT_MAXRUN;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_AUTO_EDIT_MAXRUN){
        ui = UI_AUTO_EDIT_RETRY;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_AUTO_EDIT_RETRY){
        apply_auto_settings();
        ui = UI_AUTO_MENU;
        screenNeedsRefresh = true;
        return;
    }

    /* TWIST SEQUENCE */
    if (ui == UI_TWIST){
        ui = UI_TWIST_EDIT_ON;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON){
        ui = UI_TWIST_EDIT_OFF;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF){
        ui = UI_TWIST_EDIT_ON_H;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON_H){
        ui = UI_TWIST_EDIT_ON_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_ON_M){
        ui = UI_TWIST_EDIT_OFF_H;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF_H){
        ui = UI_TWIST_EDIT_OFF_M;
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_TWIST_EDIT_OFF_M){
        apply_twist_settings();
        ui = UI_TWIST;
        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- COUNTDOWN MODE FLOW ---------------- */

    if(ui == UI_COUNTDOWN){
        if(countdownActive){
            ModelHandle_StopCountdown();
            screenNeedsRefresh = true;
        }
        else{
            ui = UI_COUNTDOWN_EDIT_MIN;
            screenNeedsRefresh = true;
        }
        return;
    }

    if(ui == UI_COUNTDOWN_EDIT_MIN){
        apply_countdown_settings();
        ui = UI_COUNTDOWN;
        screenNeedsRefresh = true;
        return;
    }
}

/* ================================================================
   EDIT VALUE ENGINE
   ================================================================ */

void increase_edit_value(void){
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:  if(edit_timer_on_h < 23) edit_timer_on_h++; break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if(edit_timer_on_m < 59) edit_timer_on_m++; break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if(edit_timer_off_h < 23) edit_timer_off_h++; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if(edit_timer_off_m < 59) edit_timer_off_m++; break;

        case UI_AUTO_EDIT_GAP:         edit_auto_gap_s++; break;
        case UI_AUTO_EDIT_MAXRUN:      edit_auto_maxrun_min++; break;
        case UI_AUTO_EDIT_RETRY:       edit_auto_retry++; break;

        case UI_TWIST_EDIT_ON:         edit_twist_on_s++; break;
        case UI_TWIST_EDIT_OFF:        edit_twist_off_s++; break;

        case UI_TWIST_EDIT_ON_H:       if(edit_twist_on_hh < 23) edit_twist_on_hh++; break;
        case UI_TWIST_EDIT_ON_M:       if(edit_twist_on_mm < 59) edit_twist_on_mm++; break;
        case UI_TWIST_EDIT_OFF_H:      if(edit_twist_off_hh < 23) edit_twist_off_hh++; break;
        case UI_TWIST_EDIT_OFF_M:      if(edit_twist_off_mm < 59) edit_twist_off_mm++; break;

        case UI_COUNTDOWN_EDIT_MIN:    if(edit_countdown_min < 999) edit_countdown_min++; break;

        default: break;
    }
}

void decrease_edit_value(void){
    switch(ui)
    {
        case UI_TIMER_EDIT_SLOT_ON_H:  if(edit_timer_on_h > 0) edit_timer_on_h--; break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if(edit_timer_on_m > 0) edit_timer_on_m--; break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if(edit_timer_off_h > 0) edit_timer_off_h--; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if(edit_timer_off_m > 0) edit_timer_off_m--; break;

        case UI_AUTO_EDIT_GAP:         if(edit_auto_gap_s > 0) edit_auto_gap_s--; break;
        case UI_AUTO_EDIT_MAXRUN:      if(edit_auto_maxrun_min > 0) edit_auto_maxrun_min--; break;
        case UI_AUTO_EDIT_RETRY:       if(edit_auto_retry > 0) edit_auto_retry--; break;

        case UI_TWIST_EDIT_ON:         if(edit_twist_on_s > 0) edit_twist_on_s--; break;
        case UI_TWIST_EDIT_OFF:        if(edit_twist_off_s > 0) edit_twist_off_s--; break;

        case UI_TWIST_EDIT_ON_H:       if(edit_twist_on_hh > 0) edit_twist_on_hh--; break;
        case UI_TWIST_EDIT_ON_M:       if(edit_twist_on_mm > 0) edit_twist_on_mm--; break;
        case UI_TWIST_EDIT_OFF_H:      if(edit_twist_off_hh > 0) edit_twist_off_hh--; break;
        case UI_TWIST_EDIT_OFF_M:      if(edit_twist_off_mm > 0) edit_twist_off_mm--; break;

        case UI_COUNTDOWN_EDIT_MIN:    if(edit_countdown_min > 1) edit_countdown_min--; break;

