Amiya200/stm32_water_tank/Core/Src/screen.c
        default: break;
    }
}

/* ================================================================
   MAIN BUTTON HANDLER — MENU LOCK + TIMER SLOT ENGINE
   ================================================================ */

void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    /* ==========================================
       CONTINUOUS HOLD FOR MENU + EDIT ONLY
       ========================================== */
    if (b == BTN_RESET_LONG)
    {
        ModelHandle_ToggleManual();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }
    if (sw3 && sw_long_issued[2]) {
        if (now - last_repeat_time >= CONTINUOUS_STEP_MS) {
            last_repeat_time = now;

            if (ui == UI_MENU){
                if (menu_idx > 0) menu_idx--;
            }
            else if (ui != UI_COUNTDOWN) {
                increase_edit_value();
            }

            else if (ui == UI_TIMER_SLOT_SELECT){
                /* scroll UP among 0..5 */
                if (currentSlot > 0) currentSlot--;
                if (currentSlot < 2) timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else timer_page = 2;
            }
            else {
                increase_edit_value();
            }
            screenNeedsRefresh = true;
        }
    }

    /* ============================================================
       COMMON LONG-PRESS HANDLER (sw4 + long press)
       ============================================================ */
    if (sw4 && sw_long_issued[3]) {

        /* ------------------------------------------
           SPECIAL CASE: COUNTDOWN LONG-PRESS INCREMENT
           ------------------------------------------ */
        if (ui == UI_DASH || ui == UI_COUNTDOWN) {

            static uint32_t cd_last_inc = 0;

            if (ui == UI_DASH) {
                ui = UI_COUNTDOWN;
                screenNeedsRefresh = true;
            }

            show_countdown();   // live view

            if (now - cd_last_inc >= COUNTDOWN_INC_MS) {
                cd_last_inc = now;
                edit_countdown_min++;
                countdownDuration = edit_countdown_min * 60;
                show_countdown();   // refresh again
            }

            return;   // IMPORTANT: skip all other long-press logic
        }

        /* ------------------------------------------
           NORMAL LONG-PRESS REPEAT HANDLING
           ------------------------------------------ */
        if (now - last_repeat_time >= CONTINUOUS_STEP_MS) {
            last_repeat_time = now;

            if (ui == UI_MENU) {
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
            }
            else if (ui == UI_TIMER_SLOT_SELECT) {
                if (currentSlot < 5) currentSlot++;
                if (currentSlot < 2)      timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else                      timer_page = 2;
            }
            else {
                decrease_edit_value();
            }

            screenNeedsRefresh = true;
        }
    }

    /* NO BUTTON EVENT */
    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* ==========================================
       IF MENU IS OPEN → BLOCK MODE ACTIONS
       Only navigation + edit allowed
       ========================================== */

    bool menu_open =
        (ui == UI_MENU ||
         ui == UI_TIMER_SLOT_SELECT ||
         ui == UI_TIMER_EDIT_SLOT_ON_H ||
         ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H ||
         ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_TIMER_EDIT_SLOT_DAYS ||
         ui == UI_TIMER_EDIT_SLOT_ENABLE ||
         ui == UI_AUTO_MENU ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         ui == UI_COUNTDOWN_EDIT_MIN);

    /* ==========================================
       HANDLE MENU BUTTONS (LOCK ACTIVE)
       ========================================== */

    if (menu_open)
    {
        /* -------- EDIT MODE -------- */
        bool editing =
            (ui == UI_TIMER_EDIT_SLOT_ON_H ||
             ui == UI_TIMER_EDIT_SLOT_ON_M ||
             ui == UI_TIMER_EDIT_SLOT_OFF_H ||
             ui == UI_TIMER_EDIT_SLOT_OFF_M ||
             ui == UI_AUTO_EDIT_GAP ||
             ui == UI_AUTO_EDIT_MAXRUN ||
             ui == UI_AUTO_EDIT_RETRY ||
             ui == UI_TWIST_EDIT_ON ||
             ui == UI_TWIST_EDIT_OFF ||
             ui == UI_TWIST_EDIT_ON_H ||
             ui == UI_TWIST_EDIT_ON_M ||
             ui == UI_TWIST_EDIT_OFF_H ||
             ui == UI_TWIST_EDIT_OFF_M ||
             ui == UI_COUNTDOWN_EDIT_MIN);

        if (editing){
            switch(b){
                case BTN_UP: increase_edit_value(); break;
                case BTN_UP_LONG: last_repeat_time = now; increase_edit_value(); break;

                case BTN_DOWN: decrease_edit_value(); break;
                case BTN_DOWN_LONG: last_repeat_time = now; decrease_edit_value(); break;

                case BTN_RESET: ui = UI_TIMER_SLOT_SELECT; break;
                case BTN_SELECT: menu_select(); break;
                default: break;
            }
            screenNeedsRefresh = true;
            return;
        }

        /* -------- TIMER SLOT SELECT -------- */
        if (ui == UI_TIMER_SLOT_SELECT){
            switch(b){
                case BTN_UP:
                    if (currentSlot > 0) currentSlot--;
                    if (currentSlot < 2) timer_page = 0;
                    else if (currentSlot < 5) timer_page = 1;
                    else timer_page = 2;
                    break;

                case BTN_DOWN:
                    if (currentSlot < 5) currentSlot++;
                    if (currentSlot < 2) timer_page = 0;
                    else if (currentSlot < 5) timer_page = 1;
                    else timer_page = 2;
                    break;

                case BTN_SELECT:
                    menu_select(); break;

                case BTN_RESET:
                    ui = UI_MENU; break;

