Amiya200/stm32_water_tank/Core/Src/screen.c
                default: break;
            }
            screenNeedsRefresh = true;
            return;
        }

        /* -------- TIMER DAYS SELECTION -------- */
        if (ui == UI_TIMER_EDIT_SLOT_DAYS){
            switch(b){
                case BTN_UP:
                case BTN_UP_LONG:
                    /* Move to next day (0..6 circular) */
                    edit_timer_dayIndex = (edit_timer_dayIndex + 1) % 7;
                    break;

                case BTN_DOWN:
                case BTN_DOWN_LONG:
                    /* Toggle current day bit */
                    edit_timer_dayMask ^= (1u << edit_timer_dayIndex);
                    break;

                case BTN_SELECT:
                    /* Advance to enable/disable step */
                    menu_select();
                    break;

                case BTN_RESET:
                    /* Cancel edit, go back to slot select */
                    ui = UI_TIMER_SLOT_SELECT;
                    break;

                default:
                    break;
            }
            screenNeedsRefresh = true;
            return;
        }

        /* -------- TIMER SLOT ENABLE/DISABLE -------- */
        if (ui == UI_TIMER_EDIT_SLOT_ENABLE){
            switch(b){
                case BTN_UP:
                case BTN_UP_LONG:
                case BTN_DOWN:
                case BTN_DOWN_LONG:
                    /* Toggle enabled flag */
                    edit_timer_enabled = !edit_timer_enabled;
                    break;

                case BTN_SELECT:
                    /* Apply settings and return to slot list */
                    apply_timer_settings();
                    ui = UI_TIMER_SLOT_SELECT;
                    break;

                case BTN_RESET:
                    /* Discard changes to enable flag only, go back */
                    ui = UI_TIMER_SLOT_SELECT;
                    break;

                default:
                    break;
            }
            screenNeedsRefresh = true;
            return;
        }

        /* -------- MAIN MENU NAVIGATION -------- */
        if (ui == UI_MENU){
            switch(b){
                case BTN_UP:
                    if(menu_idx > 0) menu_idx--;
                    break;

                case BTN_DOWN:
                    if(menu_idx < MAIN_MENU_COUNT-1) menu_idx++;
                    break;

                case BTN_SELECT:
                    menu_select();
                    break;

                case BTN_RESET:
                    ui = UI_DASH;
                    break;
            }
            screenNeedsRefresh = true;
            return;
        }

        /* For all other menu screens */
        if (b == BTN_SELECT)
            menu_select();
        else if (b == BTN_RESET)
            ui = UI_MENU;

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       BELOW THIS POINT → MENU IS NOT OPEN
       NORMAL MODE BEHAVIOR (Manual / Auto / Timer / Countdown etc.)
       ============================================================ */

    switch(b)
    {
        /* ---------- SW1 (RED) ---------- */
        case BTN_RESET:
            reset();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_RESET_LONG:
            ModelHandle_ToggleManual();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ---------- SW2 (YELLOW) ---------- */
        case BTN_SELECT:
            if(countdownActive){
                ModelHandle_StopCountdown();
                ui = UI_DASH;
                screenNeedsRefresh = true;
                return;
            }

            if(!autoActive)
                ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
            else
                ModelHandle_StopAuto();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_SELECT_LONG:
            ui = UI_MENU;
            goto_menu_top();
            screenNeedsRefresh = true;
            return;

        /* ---------- SW3 (UP) ---------- */
        case BTN_UP:
            if(!timerActive)
                ModelHandle_StartTimerNearestSlot();
            else
                ModelHandle_StopTimer();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_UP_LONG:
            if(!semiAutoActive)
                ModelHandle_StartSemiAuto();
            else
                ModelHandle_StopSemiAuto();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ---------- SW4 (DOWN) ---------- */
        case BTN_DOWN:
            if(!countdownActive){
                ModelHandle_StartCountdown(edit_countdown_min * 60);
                ui = UI_COUNTDOWN;
            } else {
                ModelHandle_StopCountdown();
                ui = UI_DASH;
            }
            screenNeedsRefresh = true;
            return;

        case BTN_DOWN_LONG:
            last_repeat_time = now;
            return;

        default:
            return;
    }
}

/***************************************************************
 *  SCREEN.C — PART 4 / 4
 *  LCD Update Engine + Final UI Dispatcher
 *  (Smooth Cursor, No Flicker, Menu Lock Enabled)
 ***************************************************************/

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* ============================================================
       CURSOR BLINK — ONLY FOR MENU MODE
       ============================================================ */
    bool cursorBlinkActive = (ui == UI_MENU);

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        draw_menu_cursor();      // Draw only the cursor (fast, no flicker)
    }

    /* ============================================================
       AUTO TRANSITION FROM WELCOME → DASH
       ============================================================ */
    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS)
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       AUTO-RETURN TO DASH AFTER INACTIVITY (1 minute)
       ============================================================ */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        now - lastUserAction >= AUTO_BACK_MS)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       AUTO DASHBOARD REFRESH (every 1 sec)
       ============================================================ */
    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        now - lastLcdUpdateTime >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       REFRESH LCD IF NEEDED OR UI CHANGED
       ============================================================ */
    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;

