Amiya200/stm32_water_tank/Core/Src/screen.c
        if (fullRefresh)
            lcd_clear();

        switch(ui)
        {
            /* ------------------
               WELCOME / DASHBOARD
               ------------------ */
            case UI_WELCOME:
                show_welcome();
                break;

            case UI_DASH:
                show_dash();
                break;

            /* ------------------
               MAIN MENU
               ------------------ */
            case UI_MENU:
                show_menu();
                break;

            /* ------------------
               TIMER MODE (5 Slots)
               ------------------ */
            case UI_TIMER_SLOT_SELECT:
                show_timer_slot_select();
                break;

            case UI_TIMER:
                show_timer();
                break;

            case UI_TIMER_EDIT_SLOT_ON_H:
                show_timer_on_h();
                break;

            case UI_TIMER_EDIT_SLOT_ON_M:
                show_timer_on_m();
                break;

            case UI_TIMER_EDIT_SLOT_OFF_H:
                show_timer_off_h();
                break;

            case UI_TIMER_EDIT_SLOT_OFF_M:
                show_timer_off_m();
                break;

            case UI_TIMER_EDIT_SLOT_DAYS:
                show_timer_days();
                break;

            case UI_TIMER_EDIT_SLOT_ENABLE:
                show_timer_enable();
                break;

            /* ------------------
               AUTO MODE
               ------------------ */
            case UI_AUTO_MENU:
                show_auto_menu();
                break;

            case UI_AUTO_EDIT_GAP:
                show_auto_gap();
                break;

            case UI_AUTO_EDIT_MAXRUN:
                show_auto_maxrun();
                break;

            case UI_AUTO_EDIT_RETRY:
                show_auto_retry();
                break;

            /* ------------------
               TWIST MODE
               ------------------ */
            case UI_TWIST:
                show_twist();
                break;

            case UI_TWIST_EDIT_ON:
                show_twist_on_sec();
                break;

            case UI_TWIST_EDIT_OFF:
                show_twist_off_sec();
                break;

            case UI_TWIST_EDIT_ON_H:
                show_twist_on_h();
                break;

            case UI_TWIST_EDIT_ON_M:
                show_twist_on_m();
                break;

            case UI_TWIST_EDIT_OFF_H:
                show_twist_off_h();
                break;

            case UI_TWIST_EDIT_OFF_M:
                show_twist_off_m();
                break;

            /* ------------------
               COUNTDOWN
               ------------------ */
            case UI_COUNTDOWN:
                show_countdown();
                break;

            case UI_COUNTDOWN_EDIT_MIN:
                show_countdown_edit_min();
                break;

            /* Fallback */
            default:
                break;
        }
    }
}
